#Betwise or  ----------> وقتی صفر برمی گردونه که همه صفر باشند
# a=0b1001
# b=0b1000

# num1=bin(a|b)

# print(num1)

# ----------------------------------------------------------------------------------------------

#Betwise and -------->  وقتی یک برمی گردونه که همه یک باشند

# a=0b1001
# b=0b1000

# num2=bin(a&b)

# print(num2)

# ------------------------------------------------------------------------------------------------

#Betwise XOR   ---------> اگر تعداد فردی یک باشه یک بر می گردونه

# a=0b1001
# b=0b1000

# num3=bin(a^b)

# print(num3)

# --------------------------------------------------------------------------------------------
#Betwise Not -----> برعکس برمیگردونه فقط دقت بشه دو تای اول برای تغییر علامت استفاده می شه و بقیه برعکس می شن
# a=0b1001
# b=0b1000

# num4=bin(~a)

# print(num4)

# ----------------------------------------------------------------------------------------------

#shift right

# a=0b1001
# b=0b1000

# num5=bin(a>>b)

# print(num5)
# ----------------------------------------------------------------------------------------------

#shift right

# a=0b1001
# b=0b1000

# num6=bin(a>>b)

# print(num6)

# ------------------------------------------------------------------------------------------------

#shift left

a=0b1001
b=0b1000

num7=bin(a<<b)

print(num7)