a=[0,1,2,3,4,5]

# سمت راست یعنی ده و بیست باید ایتربل باشدیعنی حتما باید داخل لیست یا تاپل  یا استرینگ قرار گرفته باشد
# a[1:3]=[10,20]

# استرینگ هم ایتربل هست
# a[1:3]="10"

#ده خالی اینربل نیست و موقع اجرا ارور میده
# a[1:3]=10 

# print(a)

# ----------------------------------------
#ای در در اپند هیچ تغییری نمی کنه و میوتبل هست
a=[1,2,3]
b=[4,5]

print(id(a))
# a.append(b)
# a.append(b[0])
# a.append(b[1])
# print(a)
# print(id(a))

# ولی در مثال پایین ای دی عوض می شه
# a=a+b
# print(a)
# print(id(a))

# ------------------------------

a=[1,2,3]
b=[4,5]

print(id(a))

a+=b

print(a)
print(id(a))

